Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetRadialAttributes Constructor
Overload List
Name | Description
CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes()
 Creates a new curved dimension set radial attributes instance which loads standard attributes.
CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes(Boolean)
 Creates a new curved dimension set radial attributes instance which loads standard attributes. If it set to true attributes won't be lodaded.
CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes(String)
 Creates a new curved dimension set radial attributes instance that loads the specified attributes.
Top
See Also
Reference
CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes Class
Tekla.Structures.Drawing Namespace